#+TITLE: HOWTO Run Python in Kubernetes
#+AUTHOR: Allen Gooch
#+EMAIL: allen.gooch@gmail.com
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LANGUAGE: en
#+STARTUP: overview

* Build and run the demo service in minikube
 
 Start a minikube cluster with the hyperkit vm driver on macOS.

#+BEGIN_SRC sh :results verbatim raw
minikube start --vm-driver=hyperkit
#+END_SRC

 Query the minikube cluster status with the =minikube status= command.

#+BEGIN_SRC sh :results verbatim raw
minikube status
#+END_SRC

 The output indicates that the =kubectl= command has had its context set to the
 address of the minikube cluster.

 Use the =kubectl cluster-info= command to confirm this.

#+BEGIN_SRC sh :results verbatim raw
kubectl cluster-info
#+END_SRC

 Open the cluster dashboard.

#+BEGIN_SRC sh :results none
minikube dashboard
#+END_SRC

 Leave the dashboard open so we can easily observe changes to the cluster.

 Congratulations!  You're the owner of a brand new local kubernetes cluster.

 Building images for minikube means setting the docker engine to the one
 running inside the cluster.

 When you wish docker to use the minikube docker env, you can do this in a shell
 session.

#+BEGIN_SRC sh :results verbatim raw
eval $(minikube docker-env)
#+END_SRC

 When you no longer wish docker to use the minikube docker env, you can do 
 the same passing the =-u= option for uninstall.

#+BEGIN_SRC sh :results verbatim raw
eval $(minikube docker-env -u)
#+END_SRC

 Note that all =docker= commands below will demonstrate setting the minikube
 docker environment, as each source block is effectively a different shell
 session.  In practice, you would probably only do it at the beginning of your
 shell session.

 Let's use this knowledge to list the docker images in our cluster.

#+BEGIN_SRC sh :results verbatim raw
eval $(minikube docker-env) && docker images
#+END_SRC

 Now that we know how to configure docker to use minikube, we can buld our app
 image for the cluster.  Let's build it with the =1.0.0= tag as we did before
 in the local docker install.

#+BEGIN_SRC sh :results verbatim raw
eval $(minikube docker-env) && docker build -t demo/greet-api:1.0.0 greet-api/
#+END_SRC

 It should now show up in the docker images list for the cluster.

#+BEGIN_SRC sh :results verbatim raw
eval $(minikube docker-env) && docker images
#+END_SRC

 Let's run the image in the cluster.
 
#+BEGIN_SRC sh :results verbatim raw
kubectl run greet --image=demo/greet-api:1.0.0 --port=8080 --generator=run/v1
#+END_SRC

 The =--image= argument specifies the container image we want to run, and the
 =--port= option tells Kubernetes that our app is listening on port 8080.

 The =--generator= option is something that we will not typically use, as we
 will typically provide specs describing the Kubernetes resources we are using.
 This is just a shortcut for getting a workload running quickly.

 If you now look at your dashboard you will see a [[https://kubernetes.io/docs/concepts/workloads/controllers/replicationcontroller/][replication controller]] and a
 [[https://kubernetes.io/docs/concepts/workloads/pods/pod/][pod]] resource created.

 The created pod is not directly accessible to the outside world.  To enable 
 that we need to expose it as a load balanced service.

#+BEGIN_SRC sh :results verbatim raw
kubectl expose rc greet --type=LoadBalancer --name greet-http
#+END_SRC 

 If you look again at your dashboard you will see a [[https://kubernetes.io/docs/concepts/services-networking/service/][service]] resource created.

 Now we should be able to access it once we get its external IP address.

#+BEGIN_SRC sh :results verbatim raw
kubectl get svc 
#+END_SRC

 In a non-minikube cluster, the external IP address of the =greet-http= service
 would be displayed once established.  Notice that it says =<pending>=.  

 Since minikube is a single host, it doesn’t support LoadBalancer services, so
 the service will never get an external IP.  We can still access the service 
 through its external port, but we need to ask minikube for it.

#+BEGIN_SRC sh :results verbatim raw
minikube service greet-http --url
#+END_SRC

 Finally, let's test the service at the exposed port.

#+BEGIN_SRC sh :results verbatim raw
seq 1 10 | xargs -I{} curl -s $(minikube service greet-http --url)
#+END_SRC

 Time to scale this service.

#+BEGIN_SRC sh :results verbatim raw
kubectl scale rc greet --replicas=3
#+END_SRC

#+RESULTS:
replicationcontroller "greet" scaled

 And now we're scaled to two replicas.  Don't believe me?

#+BEGIN_SRC sh :results verbatim raw
seq 1 10 | xargs -I{} curl -s $(minikube service greet-http --url)
#+END_SRC

 Check your dashboard for further confirmation.

